---
kind: property
id: P:Autodesk.Revit.DB.ViewCropRegionShapeManager.CanHaveAnnotationCrop
source: html/4ed706b0-ed41-3cba-aae5-d75d816b2ae1.htm
---
# Autodesk.Revit.DB.ViewCropRegionShapeManager.CanHaveAnnotationCrop Property

Verifies that the view is allowed to have an annotation crop.

## Syntax (C#)
```csharp
public bool CanHaveAnnotationCrop { get; }
```